{
    "data":[
       {
          "id":200,
          "title":"International Conference on Science and Contemporary Technologies (ICSCT) Opened at BUBT",
          "published_on":"5 Aug 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/200",
          "details":{
             "description":"The 2nd international conference on Science and Contemporary Technologies (ICSCT) arranged by BUBT officially opened on August 05, 2021 in Dhaka, attended by nearly 200 researchers from more than 20 different countries of the world.\nThe three-day international conference has been organized by Bangladesh University of Business and Technology (BUBT), in collaboration with the IEEE Bangladesh section, ICT Division of Bangladesh Govt. and PRAN-RFL Group, with a view to achieve scientific and technological developments in the fields of Computer Science & Engineering, Electrical & Electronic Engineering, industry 4 Applications, business informatics, robotics, cyber systems etc.\nOpening the conference as the Chief Guest, Dr. Dipu Moni, MP, Hon’ble Minister, Ministry of Education, Government of the People's Republic of Bangladesh, stated: “I believe that this gathering and sharing of knowledge will boost the competence and performance of the researchers of different nations. I would urge the researchers to innovate technologies that will be affordable, environment-friendly and easy to use to meet crisis like Covid-19. I want to say that the research on science and technology will bring out innovations that will fulfill the needs at our households, our society, country and the world as a whole.”\nI believe that the researchers will move forward surpassing all the challenges and contribute to the fulfillment of the needs of human civilization. And in this regard, I am very optimistic to reach the targeted goals.” She added.\nProf. Dr. Shafique Ahmed Siddique, Chief Patron, ICSCT 2021 & Chairman, BUBT Trust said, “The core objective of ICSCT 2021 is to produce a common platform of the researchers, industry professionals and practitioners to exchange their ideas, views and share their scientific achievements among global communities. Indeed, the ongoing pandemic has taught us the lesson that there is no alternative to research for achieving sustainable development.” Prof. Md. Abu Saleh, Member, BUBT Trust read the speech of Dr. Shafique Ahmed Siddique.\nIn his welcoming message, Prof. Dr. Muhammed Fayyaz Khan, General Chair, ICSCT 2021 & Vice Chancellor, BUBT, said, “We thank the authors for choosing this conference to present their latest research outcomes and all the participants to attend the conference through virtual mode. We have received 334 papers from 20 countries. All the papers were peer reviewed and only 126 papers were finally selected for presentation and for subsequent uploading in the IEEE digital library.”\nProf. Dr. Mohammed Moshiul Haque Chair, IEEE Bangladesh Section also spoke in the Inaugural Session and Mr. AFM Sarwar Kamal, Patron, ICSCT 2021 & Convener, International Advisory Committee, BUBT gave the Vote of thanks. Japanese Ambassador to Bangladesh H. E. Mr. ITO Naoki, Vice Chancellors, Pro-Vice Chancellors, Treasurers, notable Professors from different universities, Govt. Officials, Journalists and Teacher-officials of BUBT were present in the inaugural session of the conference.\nFollowing the Opening Session, participants along with keynote speakers will attend plenary sessions and workshops.\nResearchers from The United States, The United Kingdom, Vietnam, The United Arab Emirates, South Korea, Thailand, Saudi Arabia, Afghanistan, Australia, Canada, China, Egypt, Germany, India, Indonesia, Japan, North Korea, Malaysia, and Russia will discuss the following topics:\nMulti-Carrier Modulation Techniques for Visible Light, Security and Privacy for the Internet of Things, Role of the Smart Grid in Facilitating the Integration of Renewables, Theory and Practice: A Focus on Data Analytics, IEEE BDS Activity, 2-D Bio-signal Processing for Automation in Disease detection based on Deep Neural Networks, Potential Research Fronts in Solar Photovoltaic (PV) Technology, Power System Optimization in ETAP, Impact of Information and Communication Technology (ICT) in Textile Value Chain, and Robust Volt-Var Control in Power Distribution etc.\nMr. Zunaid Ahmed Palak, MP, Hon'ble State Minister, ICT Division, Ministry of Posts, Telecommunications and Information Technology, Government of the People's Republic of Bangladesh will be the Chief Guest of the closing session of the conference to be held on August 07, 2021 at 05pm.\nDetailed information of the International Conference can be found here: https://icsct.bubt.edu.bd/\nVideo of the Inaugural Session of the Conference can be seen through the link: https://fb.watch/7bio8v-MgE/",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/16281864231.jpg"
          },
          "category":"Event"
       },
       {
          "id":199,
          "title":"Fire Drill Training at BUBT",
          "published_on":"13 Jun 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/199",
          "details":{
             "description":"Honorable Vice Chancellor, Professor Dr. Muhammed Fayyaz Khan inaugurated the Fire Drill at BUBT. Professor Dr. Md. Ali Noor, Pro-VC, BUBT, Dr. Md. Harun-or-Rashid, Registrar, BUBT, Md. Momenul Islam, Proctor, BUBT and other high officials were also present.",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1623580519IMG_8259.JPG"
          },
          "category":"Event"
       },
       {
          "id":197,
          "title":"Webinar on \"Stress Management and Building Self Confidence\"",
          "published_on":"8 May 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/197",
          "details":{
             "description":"Webinar on \"Stress Management and Building Self Confidence\"\nDate: 8 May 2021, Saturday, Time: 9:00 pm\nKeynote Speaker: Mr. Dr. Almasur Rahman, International Motivational Speaker\nChief Guest: Prof. Dr. Mohammad Fayyaz Khan, Vice Chancellor, BUBT\nModerator: Mesbahul Hasan, Deputy Director, Career Guidance Office, BUBT",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1620160263WEB2.png"
          },
          "category":"Event"
       },
       {
          "id":195,
          "title":"EEE Olympiad by BUBT EEE Club",
          "published_on":"6 May 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/195",
          "details":{
             "description":"EEE Club of Bangladesh University of Business & Technology (BUBT) is going to organize EEE Olympiad to commemorate the contribution of Electrical and Electronic Engineering when the whole world has come to a standstill in this corona pandemic. All EEE students from all over the world can participate in it. Registration is absolutely free.\n \nRegistration link: https://forms.gle/7Wj8D8zcbd7oKkiGA\nLast time of registration: 1st May 2021\nExam Schedule: 11:00 AM-12.00 PM, 6th May 2021\nTest duration: 1 Hour (60 Minutes)\nQuestion Type: Google Form (MCQ)\n \nProcedure: Those who will register will be sent a link to the question paper via email before the exam. In due course, the link will be opened for submission. Submission will be closed exactly after an hour (60 Minutes) and no more submissions are acceptable after due time.\n \nThere are attractive prizes for the 3 best performers in the Olympiad. Moreover, there is an e-Certificate that will be sent via registered e-mail to all participants.\n \nThen what are you waiting for? Do not miss the chance to show your talent. Get yourself registered following the link ASAP.\n \nFor any event-related issues- Contact:\n01795739983\n01580330136\nBUBT EEE Club, BUBT\n \nFor Event Update follow the following Facebook Page: https://www.facebook.com/EEE-Olympiad-by-BUBT-EEE-Club-106144994865634\nYou may also mail us at bubteeeclub@gmail.com",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/161834109720210408_181551.jpg"
          },
          "category":"Event"
       },
       {
          "id":198,
          "title":"Webinar on \"Present Job Market and Its Trend\"",
          "published_on":"5 May 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/198",
          "details":{
             "description":"Webinar on \"Present Job Market and Its Trend\"\n\n\nDate: 5 May 2021, Wednesday, Time: 7.20 pm\n\n\nKeynote Speaker: Mr. Mohammad Ali Firose, AGM, BD Jobs Ltd.\n\n\nChief Guest: Prof. Dr. Ali Noor, Pro Vice Chancellor, BUBT\n\n\nModerator: Mesbahul Hasan, Deputy Director, Career Guidance Office, BUBT",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1620160263web1.png"
          },
          "category":"Event"
       },
       {
          "id":196,
          "title":"Virtual Orientation for Spring 2021 Students at BUBT",
          "published_on":"25 Apr 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/196",
          "details":{
             "description":"Bangladesh University of  Business and Technology  (BUBT) organized a virtual Orientation  Program for Spring 2021 Students on April 22, 2021.\nProfessor Dr. Md. Fayyaz Khan,  Hon'ble Vice-Chancellor, BUBT was the session chair of  the program while Prof. Mian Lutfar Rahman, member, BUBT Trust  and Prof  Dr. MD Ali Noor, Pro. Vice Chancellor were the special Guests.\nDeans of all faculties, Registrar, Controller of Exam, Director of  IQAC-BUBT, Proctor, Chairmen of departments, Faculty members, Students and Officials were connected.\nThe session chair and other speakers welcomed newly admitted students. They said BUBT is ready with all facilities for the students. If they utilize them, they can build a good career.",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1619504011BUBT_22_04__2021.jpg"
          },
          "category":"Event"
       },
       {
          "id":194,
          "title":"BUBT hosts online Discussion on Golden Jubilee of Independence and Mujib Centenary",
          "published_on":"31 Mar 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/194",
          "details":{
             "description":"Bangladesh University of Business and Technology (BUBT) organized an online discussion on Wednesday, March 31, 2021 to mark the golden jubilee of Bangladesh's great independence and the Mujib Centenary.\nMr. Kamal Ahmed Mojumder, MP, Hon'ble Minister of State, Ministry of Industries, Government of the People's Republic of Bangladesh addressed the meeting as the Chief Guest.\nHighlighting the role of Father of the Nation Bangabandhu Sheikh Mujibur Rahman in Independence, he said, \"Pakistan forces could not harm the unarmed Bengali peasants-students-people on March 7 because of Bangabandhu's foresight.\" The Hon'ble State Minister further said, “Major Ziaur Rahman did not claim himself as the Declarer of the Independence in his life. And the country and the people prepared themselves for the war of liberation under the direction of Bangabandhu.” According to Mr. Kamal, “India's contribution to Bangladesh's War of Independence is undeniable. Therefore, Bengali should not oppose India.” Mentioning that the country is moving forward under the leadership of Prime Minister Sheikh Hasina, he urged all not to support the fierce activities of ‘religious traders’.\nProfessor Dr. Shafique, Ahmed Siddique, Chairman, BUBT Trust spoke as the Guest of Honor. He called for a study of the history of the War of Liberation and the context of the Declaration of Independence. He said, “Despite pressure from the people, Bangabandhu did not declare the Independence on March 7 to get the support of the international community.\nAs the Session Chair Professor Dr. Muhammed, Fayyaz Khan, Vice Chancellor, BUBT described Bangabandhu's childhood life, Professor Md. Abu Saleh, Adviser, BUBT spoke as the Special Guest. Professor Mian Lutfar Rahman, Member, BUBT Trust delivered the keynote speech, Professor Dr. Md. Ali Noor, Pro-VC, BUBT delivered the welcome speech.\nRespected Members of BUBT Trust, Treasurer, Registrar, Director of IQAC-BUBT, Deans of faculties, Chairmen of departments, Proctor, Joint Director of Accounts, Teachers-, Officials-Staff and students were connected from Zoom and Facebook page.",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/16171826991.jpg"
          },
          "category":"Event"
       },
       {
          "id":193,
          "title":"Webinar on Research Paper Writing & Editing",
          "published_on":"25 Mar 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/193",
          "details":{
             "description":"Webinar on \"Research Paper Writing & Editing\" - Organized by Department of CSE\nDate: 25th March 2021Time: 7:15 PM",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1616305194banner_by_rafi1_for_webinar8.jpg"
          },
          "category":"Event"
       },
       {
          "id":192,
          "title":"Fall 2020-21 Orientation held at BUBT",
          "published_on":"15 Jan 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/192",
          "details":{
             "description":"Bangladesh University of Business and Technology (BUBT) organized an online orientation program to welcome the newly enrolled students of Fall-2020-21 semester on Thursday, January 14, 2021.\nStudents from the Faculty of Business, Faculty of Engineering and Applied Sciences, Faculty of Arts and Humanities, Faculty of Law and Faculty of Social Sciences took part in the orientation program where Prof. Dr. Md. Fayyaz Khan, Vice-Chancellor of BUBT was present as the Chair.\nWelcoming the newly admitted students and their parents, the Chair called upon the students to capitalize their student life by becoming the best experts in respective fields. He said, “BUBT has created all kinds of facilities for the students which include study, research and sports. And teachers, officials and staff are with them in their learning journey.”\nProf. Md. Abu Saleh, Adviser spoke as the Guest of Honor, Prof. Dr. Md. Ali Noor, Pro-VC, Prof. Mian Lutfar Rahman, Member, BUBT Trust also spoke in the program.\nDeans of faculties, Controller of Exams., Register, Proctor and other speakers highlighted the academic rules of the University. Head of Departments, Directors, teachers and staff, among others, were connected.\nVideo link: https://fb.watch/2-TuEwxYR8/",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1610689837Img_Orientation_Fall_2020-21.jpg"
          },
          "category":"Event"
       },
       {
          "id":191,
          "title":"E-Learning and the Future of Higher Education",
          "published_on":"3 Jan 2021",
          "url":"https://www.bubt.edu.bd/home/event_details/191",
          "details":{
             "description":"Event Link: https://www.facebook.com/faithbangladesh.org/posts/3540179692735144",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1609699025image1.jpeg"
          },
          "category":"Event"
       },
       {
          "id":190,
          "title":"One Research Paper is published in the high indexed and prestigious Journal (Scopus: Q1) by Md. Aslam Uddin",
          "published_on":"12 Dec 2020",
          "url":"https://www.bubt.edu.bd/home/event_details/190",
          "details":{
             "description":"",
             "images":""
          },
          "category":"Event"
       },
       {
          "id":189,
          "title":"Online Technical Presentation on Ashuganj Power Company Ltd. (APSCL)",
          "published_on":"15 Nov 2020",
          "url":"https://www.bubt.edu.bd/home/event_details/189",
          "details":{
             "description":"",
             "images":"https://www.bubt.edu.bd/assets/frontend/media/1605102287Presentation_15_11_2020_APSCL.jpg"
          },
          "category":"Event"
       }
    ],
    "status":"success",
    "type":"event"
 }