{
    "data":{
       "description":"The 2nd international conference on Science and Contemporary Technologies (ICSCT) arranged by BUBT officially opened on August 05, 2021 in Dhaka, attended by nearly 200 researchers from more than 20 different countries of the world.\nThe three-day international conference has been organized by Bangladesh University of Business and Technology (BUBT), in collaboration with the IEEE Bangladesh section, ICT Division of Bangladesh Govt. and PRAN-RFL Group, with a view to achieve scientific and technological developments in the fields of Computer Science & Engineering, Electrical & Electronic Engineering, industry 4 Applications, business informatics, robotics, cyber systems etc.\nOpening the conference as the Chief Guest, Dr. Dipu Moni, MP, Hon’ble Minister, Ministry of Education, Government of the People's Republic of Bangladesh, stated: “I believe that this gathering and sharing of knowledge will boost the competence and performance of the researchers of different nations. I would urge the researchers to innovate technologies that will be affordable, environment-friendly and easy to use to meet crisis like Covid-19. I want to say that the research on science and technology will bring out innovations that will fulfill the needs at our households, our society, country and the world as a whole.”\nI believe that the researchers will move forward surpassing all the challenges and contribute to the fulfillment of the needs of human civilization. And in this regard, I am very optimistic to reach the targeted goals.” She added.\nProf. Dr. Shafique Ahmed Siddique, Chief Patron, ICSCT 2021 & Chairman, BUBT Trust said, “The core objective of ICSCT 2021 is to produce a common platform of the researchers, industry professionals and practitioners to exchange their ideas, views and share their scientific achievements among global communities. Indeed, the ongoing pandemic has taught us the lesson that there is no alternative to research for achieving sustainable development.” Prof. Md. Abu Saleh, Member, BUBT Trust read the speech of Dr. Shafique Ahmed Siddique.\nIn his welcoming message, Prof. Dr. Muhammed Fayyaz Khan, General Chair, ICSCT 2021 & Vice Chancellor, BUBT, said, “We thank the authors for choosing this conference to present their latest research outcomes and all the participants to attend the conference through virtual mode. We have received 334 papers from 20 countries. All the papers were peer reviewed and only 126 papers were finally selected for presentation and for subsequent uploading in the IEEE digital library.”\nProf. Dr. Mohammed Moshiul Haque Chair, IEEE Bangladesh Section also spoke in the Inaugural Session and Mr. AFM Sarwar Kamal, Patron, ICSCT 2021 & Convener, International Advisory Committee, BUBT gave the Vote of thanks. Japanese Ambassador to Bangladesh H. E. Mr. ITO Naoki, Vice Chancellors, Pro-Vice Chancellors, Treasurers, notable Professors from different universities, Govt. Officials, Journalists and Teacher-officials of BUBT were present in the inaugural session of the conference.\nFollowing the Opening Session, participants along with keynote speakers will attend plenary sessions and workshops.\nResearchers from The United States, The United Kingdom, Vietnam, The United Arab Emirates, South Korea, Thailand, Saudi Arabia, Afghanistan, Australia, Canada, China, Egypt, Germany, India, Indonesia, Japan, North Korea, Malaysia, and Russia will discuss the following topics:\nMulti-Carrier Modulation Techniques for Visible Light, Security and Privacy for the Internet of Things, Role of the Smart Grid in Facilitating the Integration of Renewables, Theory and Practice: A Focus on Data Analytics, IEEE BDS Activity, 2-D Bio-signal Processing for Automation in Disease detection based on Deep Neural Networks, Potential Research Fronts in Solar Photovoltaic (PV) Technology, Power System Optimization in ETAP, Impact of Information and Communication Technology (ICT) in Textile Value Chain, and Robust Volt-Var Control in Power Distribution etc.\nMr. Zunaid Ahmed Palak, MP, Hon'ble State Minister, ICT Division, Ministry of Posts, Telecommunications and Information Technology, Government of the People's Republic of Bangladesh will be the Chief Guest of the closing session of the conference to be held on August 07, 2021 at 05pm.\nDetailed information of the International Conference can be found here: https://icsct.bubt.edu.bd/\nVideo of the Inaugural Session of the Conference can be seen through the link: https://fb.watch/7bio8v-MgE/",
       "images":"https://www.bubt.edu.bd/assets/frontend/media/16281864231.jpg"
    }
 }